import numpy

def task381(arr, i, j):
    if i > len(arr):
        return 0
    elif j > len(arr[i]):
        return 0
    else:
        return arr[i - 1][j - 1]

def task381_main():
    print(
        """
Задание 3 "Матрицы"

Пусть дана матрица:

1 2 3 4 5 6 7 8
8 7 6 5 4 3 2 1
2 3 4 5 6 7 8 9
9 8 7 6 5 4 3 2
1 3 5 7 9 7 5 3
3 1 5 3 2 6 5 7
1 7 5 9 7 3 1 5
2 6 3 5 1 7 3 2

Вариант №8. Определите структуру для хранения матрицы.

1. Пусть пользователь через консоль вводит два числа: первое - номер строки, второе - номер столбца. Напишите функцию, которая найдет число в данной позиции.
        """
    )

    arr = numpy.array([
        [1, 2, 3, 4, 5, 6, 7, 8],
        [8, 7, 6, 5, 4, 3, 2, 1],
        [2, 3, 4, 5, 6, 7, 8, 9],
        [9, 8, 7, 6, 5, 4, 3, 2],
        [1, 3, 5, 7, 9, 7, 5, 3],
        [3, 1, 5, 3, 2, 6, 5, 7],
        [1, 7, 5, 9, 7, 3, 1, 5],
        [2, 6, 3, 5, 1, 7, 3, 2]
    ])

    print(arr)
    print()
    print("arr[%d][%d] = %d" % (-3, -3, task381(arr, -3, -3)))
    print("arr[%d][%d] = %d" % (-2, -2, task381(arr, -2, -2)))
    print("arr[%d][%d] = %d" % (-1, -1, task381(arr, -1, -1)))
    print("arr[%d][%d] = %d" % (0, 0, task381(arr, 0, 0)))
    print()
    print("arr[%d][%d] = %d" % (4, 4, task381(arr, 4, 4)))
    print("arr[%d][%d] = %d" % (40, 4, task381(arr, 40, 4)))
    print("arr[%d][%d] = %d" % (4, 40, task381(arr, 4, 40)))

# task381_main()