def task341(arr):
    for i in range(len(arr)):
        mult = 1
        for j in range(len(arr[i])):
            mult *= arr[i][j]
            print("%4d\t" % arr[i][j], end = '')
        print(mult)
        
def task341_main():
    print(
        """
Задание 3 "Матрицы"

Пусть дана матрица:

1 2 3 4 5 6 7 8
8 7 6 5 4 3 2 1
2 3 4 5 6 7 8 9
9 8 7 6 5 4 3 2
1 3 5 7 9 7 5 3
3 1 5 3 2 6 5 7
1 7 5 9 7 3 1 5
2 6 3 5 1 7 3 2

Вариант №4. Определите структуру для хранения матрицы.

1. Напишите функцию умножения по строкам.
        """
    )

    arr = [
        [1, 2, 3, 4, 5, 6, 7, 8],
        [8, 7, 6, 5, 4, 3, 2, 1],
        [2, 3, 4, 5, 6, 7, 8, 9],
        [9, 8, 7, 6, 5, 4, 3, 2],
        [1, 3, 5, 7, 9, 7, 5, 3],
        [3, 1, 5, 3, 2, 6, 5, 7],
        [1, 7, 5, 9, 7, 3, 1, 5],
        [2, 6, 3, 5, 1, 7, 3, 2]
    ]

    task341(arr)   

# task341_main()