import numpy

def task353(arr):
    for i in range(len(arr)):
        for j in range(len(arr[i])):
            if arr[i][j] == 5:
                arr[i][j] = 25

def task353_main():
    print(
        """
Задание 3 "Матрицы"

Пусть дана матрица:

1 2 3 4 5 6 7 8
8 7 6 5 4 3 2 1
2 3 4 5 6 7 8 9
9 8 7 6 5 4 3 2
1 3 5 7 9 7 5 3
3 1 5 3 2 6 5 7
1 7 5 9 7 3 1 5
2 6 3 5 1 7 3 2

Вариант №5. Определите структуру для хранения матрицы.

3. Напишите функцию возведения всех чисел 5 в квадрат.
        """
    )

    arr = numpy.array([
        [1, 2, 3, 4, 5, 6, 7, 8],
        [8, 7, 6, 5, 4, 3, 2, 1],
        [2, 3, 4, 5, 6, 7, 8, 9],
        [9, 8, 7, 6, 5, 4, 3, 2],
        [1, 3, 5, 7, 9, 7, 5, 3],
        [3, 1, 5, 3, 2, 6, 5, 7],
        [1, 7, 5, 9, 7, 3, 1, 5],
        [2, 6, 3, 5, 1, 7, 3, 2]
    ])

    print(arr)
    print()
    task353(arr)
    print(arr)  

# task353_main()